Revit 2026 API

# RevitLinkTypeIsLoaded Method

---

Checks whether the link with this id is loaded.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsLoaded(
	Document document,
	ElementId typeId
)
```
```vb
Public Shared Function IsLoaded (
	document As Document,
	typeId As ElementId
) As Boolean
```
```cpp
public:
static bool IsLoaded(
	Document^ document,
	ElementId^ typeId
)
```
```fsharp
static member IsLoaded :
        document : Document *
        typeId : ElementId -> bool
```

#### Parameters

document Document
     A document. Revit will see if typeId corresponds to a loaded link in this document.
typeId ElementId
     An element id. Revit will check if typeId corresponds to a loaded link in the given document.

#### Return Value

Boolean True if typeId corresponds to a loaded RevitLinkType. False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Returns false if typeId is not the id of a RevitLinkType.

#### Reference

RevitLinkType Class

Autodesk.Revit.DB Namespace